; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v4 - type_3 ?v1 - type_1)
 	      (pred_1 ?v5 - object ?v1 - type_1)
	      (pred_3 ?v4 - type_3 ?v7 - type_2)
	      (pred_2 ?v4 - type_3 ?v5 - object ?v7 - type_2))

   (:action op_2
       :parameters  (?v4 - type_3 ?v3 ?v8 - type_1)
       :precondition (and  (pred_4 ?v4 ?v3))
       :effect (and  (pred_4 ?v4 ?v8)
		     (not (pred_4 ?v4 ?v3))))

   (:action op_3
       :parameters (?v4 - type_3 ?v6 - object ?v2 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_1 ?v6 ?v2) (pred_4 ?v4 ?v2) (pred_3 ?v4 ?v7))
       :effect (and (pred_2 ?v4 ?v6 ?v7)
		    (not (pred_1 ?v6 ?v2)) 
		    (not (pred_3 ?v4 ?v7))))

   (:action op_1
       :parameters (?v4 - type_3 ?v6 - object ?v2 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v4 ?v6 ?v7) (pred_4 ?v4 ?v2))
       :effect (and (pred_1 ?v6 ?v2)
		    (pred_3 ?v4 ?v7)
		    (not (pred_2 ?v4 ?v6 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_11 obj_02 - type_3
obj_07 obj_03 obj_10 obj_06 - type_2
obj_08 obj_01 obj_12 - type_1
obj_09 obj_05 obj_04 - object)
(:init
(pred_4 obj_11 obj_01)
(pred_3 obj_11 obj_07)
(pred_3 obj_11 obj_03)
(pred_4 obj_02 obj_08)
(pred_3 obj_02 obj_10)
(pred_3 obj_02 obj_06)
(pred_1 obj_09 obj_12)
(pred_1 obj_05 obj_12)
(pred_1 obj_04 obj_01)
)
(:goal
(and
(pred_1 obj_09 obj_08)
(pred_1 obj_05 obj_12)
(pred_1 obj_04 obj_12)
)
)

(:constraints
  (always (not (pred_4 obj_11 obj_12)))
)
)

; plan
1. (op_3 obj_11 obj_04 obj_01 obj_03)
   deleted: (pred_1 obj_04 obj_01) (pred_3 obj_11 obj_03)
   added: (pred_2 obj_11 obj_04 obj_03)
   goals met: 1 of 3
2. (op_2 obj_02 obj_08 obj_12)
   deleted: (pred_4 obj_02 obj_08)
   added: (pred_4 obj_02 obj_12)
   goals met: 1 of 3
3. (op_3 obj_02 obj_09 obj_12 obj_06)
   deleted: (pred_1 obj_09 obj_12) (pred_3 obj_02 obj_06)
   added: (pred_2 obj_02 obj_09 obj_06)
   goals met: 1 of 3
4. (op_2 obj_11 obj_01 obj_08)
   deleted: (pred_4 obj_11 obj_01)
   added: (pred_4 obj_11 obj_08)
   goals met: 1 of 3
5. (op_2 obj_02 obj_12 obj_08)
   deleted: (pred_4 obj_02 obj_12)
   added: (pred_4 obj_02 obj_08)
   goals met: 1 of 3
6. (op_1 obj_11 obj_04 obj_08 obj_03)
   deleted: (pred_2 obj_11 obj_04 obj_03)
   added: (pred_1 obj_04 obj_08) (pred_3 obj_11 obj_03)
   goals met: 1 of 3
7. (op_1 obj_02 obj_09 obj_08 obj_06)
   deleted: (pred_2 obj_02 obj_09 obj_06)
   added: (pred_1 obj_09 obj_08) (pred_3 obj_02 obj_06)
   goals met: 2 of 3
8. (op_3 obj_02 obj_04 obj_08 obj_06)
   deleted: (pred_1 obj_04 obj_08) (pred_3 obj_02 obj_06)
   added: (pred_2 obj_02 obj_04 obj_06)
   goals met: 2 of 3
9. (op_2 obj_02 obj_08 obj_12)
   deleted: (pred_4 obj_02 obj_08)
   added: (pred_4 obj_02 obj_12)
   goals met: 2 of 3
10. (op_1 obj_02 obj_04 obj_12 obj_06)
   deleted: (pred_2 obj_02 obj_04 obj_06)
   added: (pred_1 obj_04 obj_12) (pred_3 obj_02 obj_06)
   goals met: 3 of 3
